src/main/resources/webServiceRequestXmls/StageloginRequest.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:elt="http://eltws.map.ecs.com/">
   <soapenv:Header/>
   <soapenv:Body>
      <elt:callWebServiceLogin>
         <!--Optional:-->
         <loginRequest>
            <!--Optional:-->
            <serviceCode>100</serviceCode>
            <!--Optional:-->
            <componentId>110000</componentId>
            <!--Optional:-->
            <componentAuthKey>110000</componentAuthKey>
            <!--Optional:-->
            <channel>31</channel>
            <!--Optional:-->
            <userId>123456</userId>
            <!--Optional:-->
            <password>0bb504cd4e03824b0951fa76fbe42cd76874e03dec70f1230adc0ee144d9b03a1207c5207192767d7ef9ee3bad644b1cdbb9cbbe18c59d6b119dc85ab0298eb4</password>
            <!--Optional:-->
            <ip>172.27.144.199</ip>
            <!--Optional:-->
            <transactionCounter>430823</transactionCounter>
            <!--Optional:-->
            <bankCode>110000</bankCode>
         </loginRequest>
      </elt:callWebServiceLogin>
   </soapenv:Body>
</soapenv:Envelope>